#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```hcl
terraform
Acquiring state lock. This may take a few moments...
tls_private_key.hashicat: Refreshing state... [id=fe2c6f5db97183dee741591d4073bc3ff936d889]
aws_vpc.hashicat: Refreshing state... [id=vpc-0982e8d1f82bba968]
data.aws_ami.ubuntu: Reading...
data.aws_ami.ubuntu: Read complete after 0s [id=ami-05a5333b72d3d1c93]
aws_internet_gateway.hashicat: Refreshing state... [id=igw-0e28943a83ac161fd]
aws_security_group.hashicat: Refreshing state... [id=sg-04bab02fd3a58f7ec]
aws_subnet.hashicat: Refreshing state... [id=subnet-08c9ca6a2de3a6de3]
aws_route_table.hashicat: Refreshing state... [id=rtb-0ca5554b915f46b6c]
aws_route_table_association.hashicat: Refreshing state... [id=rtbassoc-048f4cfd6ef84e1b4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_eip.hashicat will be created
  + resource "aws_eip" "hashicat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = {
          + "Owner"   = "jerry & tom"
          + "Project" = "Coffee-Mug-Cake"
        }
      + vpc                  = true
    }

  # aws_eip_association.hashicat will be created
  + resource "aws_eip_association" "hashicat" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip_address   = (known after apply)
      + public_ip            = (known after apply)
    }

  # aws_instance.hashicat will be created
  + resource "aws_instance" "hashicat" {
      + ami                                  = "ami-05a5333b72d3d1c93"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "DEV-ssh-key.pem"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-08c9ca6a2de3a6de3"
      + tags                                 = {
          + "Name" = "DEV-hashicat-instance"
        }
      + tags_all                             = {
          + "Name"    = "DEV-hashicat-instance"
          + "Owner"   = "jerry & tom"
          + "Project" = "Coffee-Mug-Cake"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-04bab02fd3a58f7ec",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_key_pair.hashicat will be created
  + resource "aws_key_pair" "hashicat" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "DEV-ssh-key.pem"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC9E0Gq1YjwBWyF8aW56XUFHdljOvCRLRLHW56S4jUmiIkJfVG6iwCubUEmjFcQ63nb8zuLYrRrvdZX4vzbOj5U9USaiOfz6nIOJplh7HqPKqQusyyl7VF1wZzlG2t+4H4WEnD+TI+S9EncjIWjr2Mmn/IcqqQYvW5bw1JEiTBW7SnTCEfJcgbiyrGVKsJgINanfUzhnsvjB7HcKYlX4Gf6mGeNWCXH9PdrSkRjfNsUPlh7yCYB/U9j09JnLQ3u8JyOP+xt7iOnLRrqFC9djf1ir18PQ9t5GjrY2N8cNtqac3nvbxtwE1qj037d67F0aLiQ069G54Xapv1XMHPfwuc3"
      + tags_all        = {
          + "Owner"   = "jerry & tom"
          + "Project" = "Coffee-Mug-Cake"
        }
    }

  # aws_vpc.hashicat will be updated in-place
  ~ resource "aws_vpc" "hashicat" {
        id                                   = "vpc-0982e8d1f82bba968"
      ~ tags                                 = {
          ~ "environment" = "Production" -> "dev"
            # (1 unchanged element hidden)
        }
      ~ tags_all                             = {
          ~ "environment" = "Production" -> "dev"
            # (3 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)
    }

  # null_resource.configure-cat-app will be created
  + resource "null_resource" "configure-cat-app" {
      + id = (known after apply)
    }

Plan: 5 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + catapp_ip  = (known after apply)
  + catapp_url = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
**Pusher**: @lgpon98125
**Action**: pull_request
